
// مجموعة اقتباسات للشيخ علي بن حاج
export const quotes = [
  {
    id: 1,
    text: "من هو الجيل الذي سوف يحرر بيت المقدس والمسجد الأقصى ؟ نحن نعتقد أن طليعة الجهاد والمجاهدين إنما هم الطائفة المنصورة، ونعتقد أن الجيل الذي سوف يحقق الله تعالى على يده النصر والانتصار ودحر الاستعمار الغاشم هو ذلك الجيل الذي تكون طليعته ونواته الصلبة، هم الطائفة المنصورة المذكورة في الأحاديث الصحيحة لأنهم يقاتلون على الحق لا يضرهم من خالفهم ولا من خذلهم من الحكام العملاء وعلماء السوء أو الجماهير الغافلة المتخاذلة الواقعة بين استبداد الحكام وقهرهم وتضليل علماء السوء، فهم الذين سيتصدون بالجهاد الشرعي الصادق وهم رأس الحربة في المقاومة، الصامدة منصورة بظهور الحجة والبيان وبظهور السيف والسنان لقوله صلى الله عليه وسلم \"على الحق ظاهرين\" وقوله \"يقاتلون على الحق\" فهم دعاة للحق بالحجة ومجاهدون ومقاتلون عليه ولو خالفهم أو خذلهم الناس.",
  },
  {
    id: 2,
    text: "إنّ محنة الدُّول العربيَة و الإسلاميَة واحدَة أساسُها ورأسها قادة وجنرالات المؤسسات العسكريَة الذي اختطفوا هذه المؤسسات وجعلوها فوق الدولة لتصبح وصيّة على الشعوب و خياراتها.",
  },
  {
    id: 3, 
    text: "لو كان حكام الدول العربية والإسلامية يتمتعون بشرعية شعبية حقيقية لعرفوا كيف يوظفون موارد ومصالح شعوبهم المختلفة في الدفاع عن دينها ودنياها ومقومات هذه الشعوب الحضارية ولأجبروا أمريكا والدول الأوروبية على احترامهم واحترام خصوصيات شعوبهم ولو عرف هؤلاء الحكام كيف يستخدمون مبدأ المعاملة بالمثل لما تجاوزت أمريكا وبعض الدول الأوربية حدودها ولحسبت لهم ألف حساب، ولأشركتهم في صياغة القوانين العامة الدولية.",
  },
  {
    id: 4,
    text: "هذه القوانين التي يروق للبعض أن يطلق عليها قوانين دولية يجب أن نطرح السؤال، هل يصح أن نطلق عليها هذه التسمية إذ لا يمكن أن نطلق على أي قانون بأنه دولي إلا إذا شاركت في طرحه ونقاشه وصياغته كل دول العالم، وهذا ما لا يسنده الواقع، فهي تسمية كاذبة وخادعة ومضللة، ولا تدل على المسمى والواجب أن يطلق عليها قوانين أميركية أو أوروبية مفروضة، وإذا كان الأمر كذلك، ما الذي يدفع بالدول العربية والإسلامية ودول العالم الثالث إلى الخضوع إليها، وهم لم يشاركوا في صياغتها ووضعها لا من قريب ولا من بعيد؟ !!!.",
  },
  {
    id: 5,
    text: "حيث أن أغلب حكام العالم العربي والإسلامي يفتقدون أهم مواصفات الحاكم الشرعي ومعظمهم قد أخلَّ بمقاصد الحكم الراشد شرعا بل أتوا بأقوال وأعمال وأفعال مضادة لمقاصد الشريعة الكبرى فقد وجب على علماء الأمة الراسخين في العلم القيام بواجبهم الشرعي نحو الأمة بحكم أنهم يندرجون في مسمى أولي الأمر في الأمة بل هناك من العلماء من قدَّم طاعة العلماء على طاعة الحكام عند التعارض والتنازع.",
  },
  {
    id: 6,
    text: "خطابُ الله ليسَ موجّها فقط للعُلماء والدّعاة ولا أهل السياسة من حكّام ومسؤولين بل هو خطاب موجّه لعموم الأمّة، فقول الله عزّ وجل مثلا \"وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا\" فهذا حكم الله في السارق ينفّذه الحاكم، لكنّ الخطاب كما يقول العلماء موجّه إلى الأمّة و على الأمّة أن تجدَ الحَاكم الذي ينفّذ هذه الأحكـَام و لهذا يأتي الخطاب بالعموم \"فَاقْطَعُوا\".",
  },
  {
    id: 7,
    text: "كان الرسول صلى الله عليه وسلم يدعو لرجال يسميهم بأسمائهم فيقول \"اللهم انج الوليد ابن الوليد وسلمة بن هشام وعياش بن أبي ربيعة والمستضعفين من المؤمنين اللهم اشدد وطأتك على مضر واجعلها عليهم سنين كسني يوسف\".",
  },
  {
    id: 8,
    text: "الإسلام دين يكره الاستعباد والاستبداد ومن أجل ذلك كان جوهر الرسالات عبادة الله والكفر بكل ألوان الطواغيت قال الله تعالى \"وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَّسُولاً أَنِ اعْبُدُواْ اللّهَ وَاجْتَنِبُواْ الطَّاغُوتَ\"",
  },
  {
    id: 9,
    text: "مهمة الدعاة في الإسلام ليست مقصورة على بيان الأحكام الشرعية المتعلقة بالعبادات الفردية بل تتعداها إلى بيان أحكام العبادات الاجتماعية والسياسية والإنسانية \"وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه\" وفي الحديث \"من كتم علما ألجمه الله بلجام من نار\".",
  },
  {
    id: 10,
    text: "\"كُلًّا نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ\" فلابدّ من تذكير أصحاب الشدة بسير الأنبياء والصالحين و طبيعة الطريقة، لأن طريق الجنة صعب وشاق إذ حفت الجنة بالمكاره وحفت النار بالشهوات، غير أن الإنسان عند المحنة يحتاج إلى من يذكره لتقوى عزيمته ولا ينهار.",
  },
  {
    id: 11,
    text: "إن المشروع الإصلاحي الحقيقي يبدأ من الإنسان، ببناء وعيه وتحصين هويته وترسيخ قيمه الأصيلة، ثم ينطلق نحو الإصلاح المجتمعي الشامل.",
  },
  {
    id: 12,
    text: "\"أفلا يتدبرون القرآن أم على قلوب أقفالها\" فليس المقصود من إنزال القرآن مجرد التلاوة الحسنة بلا فهم ولا تدبر، قال الإمام علي رضي الله عنه \"لا خير في عبادة لا علم فيها، ولا خير في علم لا فهم فيه، ولا خير في قراءة لا تدبر فيها\"، فلا بد من إعمال الفكر و إجالة النظر والغوص في المعاني، قال عبد الله بن مسعود رضي الله عنه \"من أراد علم الأولين والآخرين فليثور القرآن فإن فيه علم الأولين والآخرين\"",
  },
  {
    id: 13,
    text: "قديما قالوا \"ما ضاع حق وراءه طالب\" وصدق رسول الله عليه وسلم \"لا يزال الله يغرس في هذا الدين غرسا يستعملهم فيه بطاعته إلى يوم القيامة\" وصدق الله تعالى إذ يقول \"وجعلنا منهم أئمة يهدون بأمرنا لما صبروا وكانوا بآياتنا يوقنون\".",
  },
  {
    id: 14,
    text: "إذا كان الإسلام يدعو إلى التعاون والتكافل بين المؤمنين في الأحوال العادية فمن باب أولى أن يكون ذلك في حالات الشدة والضيق وفي الحديث \"من خلف غازيا في أهله بخير فقد غزا\" وفي الحديث الآخر \"الساعي على الأرملة والمسكين كالمجاهد في سبيل الله أو كالذي يصوم النهار ويقوم الليل\".",
  },
  {
    id: 15,
    text: "هذه البلاد وغيرها من بلاد المسلمين يجب أن يحكمها الإسلام ... الإسلام وحده.",
  },
  {
    id: 16,
    text: "كلنا لآدم وآدم من تراب \"إن أكرمكم عند الله أتقاكم\" من أي جنس ومن أي لون كان وبأي لسان تكلم، ومن أي بقعة في الكرة الأرضية كان ونصوص الكتاب والسنة تنهى عن الكبرياء والعلو في الأرض والمس واحتقار الآخرين لأجناسهم وألوانهم أو اختلاف ألسنتهم فالمعيار الوحيد عند الله تبارك وتعالى هي التقوى لا غير ومن اعتز بغير الإسلام وتقوى الله تعالى فهو فحم جهنم.",
  },
  {
    id: 17,
    text: "الدعاء سلاح فعّال لمن أخلص فيه لله تعالى وقد كان قادة الجند من الرعيل الأول يستصحبون الصالحين طلبا لدعائهم الصالح وكان الرسول صلى الله عليه وسلم يمر على أصحابه في مكة يعذبون فلا يملك إلا أن يقول \"صبرا آل ياسر فإن موعدكم الجنة\".",
  },
  {
    id: 18,
    text: "من حقائق هذا الدين العظيم أنه لا أخوة بلا إيمان ولا أخوة بلا نصرة ولا نصر إلا بالأخوة الحقة \"هو الذي أيدك بنصره وبالمؤمنين\" فالتناصر بين المسلمين فريضة وليس نافلة من النوافل وأدلة وجوب التناصر كثيرة من الكتاب والسنة",
  },
  {
    id: 19,
    text: "الجوع والفقر والحاجة من أكبر مهددات أمن المجتمعات ولذلك قال الصحابي الجليل رضي الله عنه \"عجبت لمن لا يجد قوت يومه كيف لا يخرج شاهرا سيفه على الناس\".",
  },
  {
    id: 20,
    text: "قال علي رضي الله عنه \"لا تقاتلوا الخوارج بعدي، فليس من طلب الحق فأخطأه كمن طلب الباطل فأدركه\".",
  },
  {
    id: 21,
    text: "الإسلام يفرق بين الأمن الشرعي والأمن القهري فالأمن الشرعي يجب أن يقوم على الشرعية والمشروعية والأمن القهري هو القائم على الاستبداد والاغتصاب، فالأول يجب الخضوع له أما الثاني فيجب مقاومته بجميع الوسائل المشروعة لمن قدر على ذلك.",
  },
  {
    id: 22,
    text: "الإسلام قوي بعقائده و أخلاقه و مبادئه على مرّ الزمان و الدهور الى أن يرث الله الأرض و من عليها و هو خير الوارثين والإسلام يملك ـ بفضل الله تعالى ـ القدرة المدهشة على الإقناع و المناظرة و الجدال بالتي هي أحسن و الحوار الواضح الصريح و الأخذ و الرد دون اكراه أو اجبار ولكنه في ذات الوقت علّم اتباعه و معتنقيه أصول العزة و الإباء و الشمم ـ في انصاف و اعتدال ـ أمام كل من تسوّل له نفسه الاعتداء عليهم أو على عقائدهم و مشاعرهم الدينية.",
  },
  {
    id: 23,
    text: "\"الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللًّهِ ألا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ\" حياةُ القلب بذكر الله عزّ و جل، و ذكر الله هنا ليس المقصود به فقط الأدعية و الأذكار كسبحان الله والحمد لله بل هو عامّ و لهذا قال الإمام عطاء \"مجالس الحلال و الحرام مجلس ذكر\".",
  },
  {
    id: 24,
    text: "من القوانين التي يجب أن لا نغفل عنها قانون التدافع وإلا ضاعت العقائد والأديان قال تعالى \"ولولا دفع الله الناس بعضهم ببعض لَهدِّمت صوامع وبيَع وصلوات ومساجد يُذكر فيها اسم الله كثيراً\" وقال عزّ وجل \"ولولا دفع الله الناس بعضهم ببعض لَفسدت الأرض\".",
  },
];

// دالة للحصول على اقتباس عشوائي
export const getRandomQuote = () => {
  const randomIndex = Math.floor(Math.random() * quotes.length);
  return quotes[randomIndex];
};
